# RebarShapeConstraintRadius Properties

---
The RebarShapeConstraintRadius type exposes the following members.
| Name| Description
---|---|---
| ArcReferenceType|  The choice of rule for measuring the radius.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
#### Reference
RebarShapeConstraintRadius Class
Autodesk.Revit.DB.Structure Namespace